# Ultralytics YOLO 🚀, AGPL-3.0 license
# Dual-Stream Backbone for Multispectral Detection (RGB + NDVI)
# FINAL GOLDEN VERSION: Exact Specs + Custom Scale + Correct Expansion (0.25)

# Parameters
nc: 4
# QUAN TRỌNG: Giữ nguyên thông số, không scale tự động
scales:
  custom: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]

  # 0. ROOT NODE
  - [-1, 1, InputContainer, []]

  # === BRANCH 1: RGB (YOLOv11s Donor) ===
  # Args cho C3k2: [c2, c3k_bool, e]
  # Source 11s dùng e=0.25 cho Backbone!

  - [0, 1, Conv, [32, 3, 2]] # 1
  - [-1, 1, Conv, [64, 3, 2]] # 2
  - [-1, 1, C3k2, [128, False, 0.25]] # 3 (Fix: e=0.25)
  - [-1, 1, Conv, [128, 3, 2]] # 4
  - [-1, 1, C3k2, [256, False, 0.25]] # 5 (Fix: e=0.25)
  - [-1, 1, Conv, [256, 3, 2]] # 6
  - [-1, 1, C3k2, [512, True, 0.25]] # 7 (Fix: e=0.25)
  - [-1, 1, Conv, [512, 3, 2]] # 8
  - [-1, 1, C3k2, [512, True, 0.25]] # 9 (Fix: e=0.25)
  - [-1, 1, SPPF, [512, 5]] # 10

  # === BRANCH 2: NDVI (YOLOv11n Donor) ===
  # Source 11n cũng dùng e=0.25

  - [0, 1, Conv, [16, 3, 2]] # 11
  - [-1, 1, Conv, [32, 3, 2]] # 12
  - [-1, 1, C3k2, [64, False, 0.25]] # 13
  - [-1, 1, Conv, [64, 3, 2]] # 14
  - [-1, 1, C3k2, [128, False, 0.25]] # 15
  - [-1, 1, Conv, [128, 3, 2]] # 16
  - [-1, 1, C3k2, [256, True, 0.25]] # 17
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [-1, 1, C3k2, [256, True, 0.25]] # 19
  - [-1, 1, SPPF, [256, 5]] # 20

head:
  # === FUSION NECK ===
  # P3: 256(RGB) + 128(NDVI) = 384
  - [[5, 15], 1, Concat, [1]] # 21 (Fused P3)

  # P4: 512(RGB) + 256(NDVI) = 768
  - [[7, 17], 1, Concat, [1]] # 22 (Fused P4)

  # P5: 512(RGB) + 256(NDVI) = 768
  - [[10, 20], 1, Concat, [1]] # 23 (Fused P5)

  # === HEAD ===
  - [23, 1, C3k2, [512, False]] # 24 (Head P5)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 22], 1, Concat, [1]] # 26
  - [-1, 1, C3k2, [256, False]] # 27 (Head P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[-1, 21], 1, Concat, [1]] # 29
  - [-1, 1, C3k2, [128, False]] # 30 (Head P3)

  - [-1, 1, Conv, [128, 3, 2]] # 31
  - [[-1, 27], 1, Concat, [1]] # 32
  - [-1, 1, C3k2, [256, False]] # 33

  - [-1, 1, Conv, [256, 3, 2]] # 34
  - [[-1, 24], 1, Concat, [1]] # 35
  - [-1, 1, C3k2, [512, True]] # 36

  - [[30, 33, 36], 1, Detect, [nc]] # 37
