# Ultralytics YOLO 🚀, AGPL-3.0 license
# Dual-Stream Backbone for Multispectral Detection (RGB + NDVI)
# Branch 1: YOLOv11s (RGB)
# Branch 2: YOLOv11n (NDVI)
# Fusion: Concat at P3, P4, P5

# Parameters
nc: 4  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024] 
  # Note: Dual backbone mixes scales, so we define explicit channels below mostly.

backbone:
  # [from, repeats, module, args]
  
  # 0. ROOT NODE (Input Holder)
  # Input image (4 channels) enters here and is held for splitting
  [[-1, 1, InputContainer, []],  # 0
   
   # === BRANCH 1: RGB (YOLOv11s Architecture) ===
   # Takes from 0 (Input)
   [0, 1, Conv, [64, 3, 2]],  # 1-P1/2 (Stem)
   [-1, 1, Conv, [128, 3, 2]], # 2-P2/4
   [-1, 1, C3k2, [128, False, 0.25]],
   [-1, 1, Conv, [256, 3, 2]], # 4-P3/8
   [-1, 1, C3k2, [256, False, 0.25]],
   [-1, 1, Conv, [512, 3, 2]], # 6-P4/16
   [-1, 1, C3k2, [512, True]],
   [-1, 1, Conv, [1024, 3, 2]], # 8-P5/32
   [-1, 1, C3k2, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],  # 10 (Output P5 of Branch 1)

   # === BRANCH 2: NDVI (YOLOv11n Architecture) ===
   # Takes from 0 (Input) AGAIN -> Parallel Stream
   [0, 1, Conv, [16, 3, 2]],  # 11-P1/2 (Stem Nano - smaller channels)
   [-1, 1, Conv, [32, 3, 2]], # 12-P2/4
   [-1, 1, C3k2, [32, False, 0.25]],
   [-1, 1, Conv, [64, 3, 2]], # 14-P3/8
   [-1, 1, C3k2, [64, False, 0.25]],
   [-1, 1, Conv, [128, 3, 2]], # 16-P4/16
   [-1, 1, C3k2, [128, True]],
   [-1, 1, Conv, [256, 3, 2]], # 18-P5/32
   [-1, 1, C3k2, [256, True]],
   [-1, 1, SPPF, [256, 5]],   # 20 (Output P5 of Branch 2)
  ]

head:
  [
   # === FUSION NECK ===
   # Fusion at P3 (Layer 4 from RGB + Layer 14 from NDVI)
   [[4, 14], 1, Concat, [1]], # 21 (Fused P3)
   
   # Fusion at P4 (Layer 6 from RGB + Layer 16 from NDVI)
   [[6, 16], 1, Concat, [1]], # 22 (Fused P4)
   
   # Fusion at P5 (Layer 10 from RGB + Layer 20 from NDVI)
   [[10, 20], 1, Concat, [1]], # 23 (Fused P5)

   # === YOLOv11 Head Structure (Adapted for Fusion Inputs) ===
   # Processing P5
   [23, 1, C3k2, [512, False]], # 24

   # Upsample to P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 22], 1, Concat, [1]], # 26 cat backbone P4
   [-1, 1, C3k2, [512, False]], # 27

   # Upsample to P3
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 21], 1, Concat, [1]], # 29 cat backbone P3
   [-1, 1, C3k2, [256, False]], # 30 (P3/8-small)

   # Downsample to P4
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 27], 1, Concat, [1]], # 32 cat head P4
   [-1, 1, C3k2, [512, False]], # 33 (P4/16-medium)

   # Downsample to P5
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 24], 1, Concat, [1]], # 35 cat head P5
   [-1, 1, C3k2, [1024, True]], # 36 (P5/32-large)

   # Detect
   [[30, 33, 36], 1, Detect, [nc]], # Detect(P3, P4, P5)
  ]